{"extracted_information": "Detailed preferences of US consumers regarding e-commerce deliveries based on a McKinsey proprietary survey of over 1,000 US consumers (weighted to represent the broader US population). Key findings indicate a shift from prioritizing speed to prioritizing cost and reliability, a high willingness to wait for free shipping, and demand for flexibility and some willingness to pay for sustainability.", "specifications": {}, "pricing": {"cost_sensitivity": {"cart_abandonment_due_to_shipping_costs": "90% of consumers are likely to abandon shopping carts that feature high shipping costs for standard items.", "primary_factor_2024": "Cost ranked as the number-one factor when assessing e-commerce deliveries in 2024.", "unwillingness_to_pay_for_2_day_shipping": "More than 80% of consumers aged 55 and over say they will not pay for two-day shipping.", "unwillingness_to_pay_for_any_shipping": "About 50% of consumers overall say they are unwilling to pay anything for shipping regardless of delivery speed."}, "willingness_to_pay_for_sustainability": {"overall": "More than 35% of survey respondents are willing to pay an additional one or two dollars for more sustainable shipping.", "18_34_year_olds": "More than 55%", "urban_consumers": "More than 50%", "above_average_income_households": "More than 45%"}, "shipping_cost_preference": {"free_vs_paid_expedited": "More than 95% of survey respondents prefer free shipping with standard delivery versus paid shipping with expedited delivery."}}, "features": {"delivery_speed_preferences": {"willingness_to_wait_general": "90% of consumers are willing to wait two or three days for deliveries, especially if it helps them avoid shipping costs.", "willingness_to_wait_up_to_3_days": "Across categories, almost 90% of consumers are willing to wait up to three days for delivery.", "willingness_to_wait_for_free_delivery_4_7_days": "More than 80% say they will still buy an item when delivery takes four to seven days, as long as that delivery is free.", "priority_for_fastest_delivery": "Less than 5% prioritize the fastest delivery option without concern for price.", "product_category_variation": {"household_consumables": "Shoppers tend to be less willing to wait more than three days for a delivery.", "fashion": "Shoppers exhibit slightly more willingness to wait."}, "geographical_variation": {"rural_consumers": "More than 55% are willing to wait seven days or more for deliveries as long as shipping is free."}}, "delivery_reliability": {"importance_over_speed": "Consumers place high value on items being delivered within the promised arrival window. On-time delivery is ranked as more important to their satisfaction than speedy delivery.", "preference_for_on_time_over_speedy_but_late": "They would rather wait up to a week for an on-time delivery than have a delivery arrive later than expected.", "tracking_behavior": "About 50% of respondents track the status of orders to ensure that the shipment is progressing and remains on time.", "definition_of_unacceptably_late": "About 85% of respondents say they do not consider an order 'unacceptably late' if it arrives within one to two days of the expected delivery time."}, "optionality_and_flexibility": {"scheduling_deliveries_importance": "More than 50% of survey respondents place importance on being able to schedule deliveries.", "return_policy_impact": "More than 65% of survey respondents are likely to abandon an online shopping cart if the return policy on items is inflexible (e.g., if items are final sale with no returns possible).", "urban_consumer_preferences": {"delivery_location_diversity": "About 45% have online shipments delivered to locations other than their home (e.g., workplace, brick-and-mortar store, delivery locker).", "scheduling_importance": "About 70% place importance on being able to schedule delivery times."}}, "sustainability": {"priority_ranking": "Environmental sustainability and climate-neutral delivery options rank comparatively lower among overall consumer priorities for e-commerce delivery."}}, "statistics": {"survey_details": {"respondents": "More than 1,000 US consumers", "data_points": "More than 150,000 data points"}, "e_commerce_growth": {"2019_2023_annual_growth": "18%", "normalized_annual_growth": "Roughly 6%"}, "parcel_delivery_speed_acceleration": {"q1_2020_average_days": "6.6 days", "q2_2023_average_days": "4.2 days", "percentage_acceleration": "About 40%"}, "on_time_delivery_percentage": {"pre_pandemic": "Around 85% to 90%", "may_2020_low": "About 72%"}}, "temporal_info": {"article_date": "February 13, 2025", "survey_comparison_years": {"consumer_survey_2022": "Speed ranked highest among delivery priorities.", "consumer_survey_2024": "Speed fell to fifth priority; Cost became the number-one factor."}}, "geographical_data": {"us_population_representation": "Survey respondents weighted to represent the broader US population in terms of age, race, income levels, and other factors.", "rural_consumers": {"willingness_to_wait_for_free_delivery": "More than 55% are willing to wait seven days or more for deliveries as long as shipping is free."}, "urban_consumers": {"off_home_delivery_locations": "About 45% deliver to locations other than their home (workplace, store, locker).", "scheduling_delivery_importance": "About 70% place importance on being able to schedule delivery times.", "willingness_to_pay_for_sustainability": "More than 50%."}}, "references": ["McKinsey proprietary survey of more than 1,000 US consumers"]}