{"extracted_information": "The 'State of the Consumer 2025' report reveals that crisis-era consumer habits have persisted, leading to a permanent shift in behavior. Despite global consumer sentiment being poorer than in early 2020 due to inflation concerns, spending continues, and the link between sentiment and spending has weakened. Consumers prioritize value and convenience, often making unexpected cross-category trade-offs. The old frameworks for understanding consumer behavior no longer apply, as adaptations from the COVID-19 pandemic have solidified into lasting changes.\n\n**Key Behavioral Forces Shaping the Sector (US Focus):**\n1.  **Increased Alone Time & Digital Engagement:** US consumers are spending more time alone and online. Free time has increased, with a significant portion dedicated to solo activities like hobbies, independent relaxation, shopping, fitness, and social media. E-commerce and food delivery services are highly adopted. This trend is driven by a 'bring-it-to-me' mindset, reshaping retail, dining, and grocery delivery, with expectations for speed, low cost, reliability, and easy returns constantly rising.\n2.  **Digital Channels' Influence (Despite Trust Issues):** While social media is the least trusted source for buying decisions in the US and Europe, interactions with friends and family (most trusted sources) occur there. Digital platforms, including social media, significantly influence purchase journeys and brand perceptions. Social media use for product research has increased, and a notable percentage of US consumers have purchased brands discovered via social media.\n3.  **Gen Z as a Dominant Segment:** Gen Z (born 1996-2010) is projected to be the largest and wealthiest generation. Their experiences have shaped their values, leading them to prioritize financial security (career success, wealth creation) over traditional life stage milestones. Despite financial worries and smaller savings, US Gen Zers are prone to spending, splurging, and taking on debt, often paying a premium for convenience, including delivery services. They are setting future consumer expectations.\n4.  **Preference for Local:** Consumers, particularly in the US and Canada, show a growing preference for buying local brands, primarily to support domestic businesses. This trend means multinational companies face a higher bar and must tailor offerings to local tastes and source locally where possible.\n5.  **New Approaches to Value:** Rising prices remain the top concern. Consumers are actively 'trading down' (seeking deals on every purchase, delaying purchases) but also engaging in 'cross-category trade-downs' (cutting back in one area to splurge in another, even non-discretionary to discretionary). Despite financial concerns, many still plan to splurge. Discount and wholesale channels continue to attract consumers across demographics.", "specifications": {"survey_methodology": {"mckinsey_consumerwise_sentiment_survey": {"fielding_dates": "April 26 to May 5, 2025", "respondents": "25,998 consumers", "markets": "18 markets (together accounting for ~75% of global GDP)", "data_weighting": "Weighted by contribution of each respondent’s nation to global GDP"}, "mckinsey_state_of_consumer_market_survey": {"total_respondents": "2,838 consumers", "us_respondents": "1,327", "us_fielding_dates": "April 23 to April 28, 2025", "china_respondents": "600", "china_fielding_dates": "April 30 to May 6, 2025", "germany_respondents": "572", "germany_fielding_dates": "April 28 to April 30, 2025", "uk_respondents": "339", "uk_fielding_dates": "April 28 to April 30, 2025"}}}, "pricing": {"value_equation_trends": {"trading_down_prevalence": "79% of surveyed consumers are trading down", "deal_seeking_frequency": ">50% of surveyed consumers look for deals on every purchase", "purchase_delay_us": "49% of US consumers surveyed plan to delay purchases over the next three months", "apparel_sales_us": "47% of US consumers surveyed wait for a sale or promotion for apparel (vs. 22% in Germany and UK)", "cross_category_trade_downs_h1_2025": ">1/3 of consumers surveyed traded down in one category while planning to splurge in another", "nondiscretionary_to_discretionary_splurge": "19% of surveyed consumers globally plan to cut back in a nondiscretionary category but splurge in a more discretionary category", "splurging_despite_concerns": ">1/3 of consumers concerned about rising prices still have plans to splurge", "discount_wholesale_channel_use_us_gen_z": "80% of surveyed US Gen Zers reported shopping at a wholesaler in the previous month"}}, "features": [], "statistics": {"us_consumer_free_time": {"increase_2025_vs_2019": ">3 hours more free time per week, on average", "allocation_to_solo_activities": "Nearly 90% of increased free time allocated to solo activities"}, "online_shopping_adoption": {"online_only_retailer_past_month": {"china_us": ">90%", "germany_uk": ">80%"}, "grocery_delivery_past_week": {"germany_uk_us": "Nearly 40%"}, "go_to_shopping_destination": {"amazon_taobao": ">1/3 of consumers across all four regions (China, Germany, UK, US)"}}, "food_service_spending_share_food_delivery": {"2019": "9%", "2024": "21%"}, "social_media_influence": {"least_trusted_for_buying_decisions": "Social media (in Europe and US)", "most_trusted_for_buying_decisions": "Family and friends", "product_research_on_social_media_increase": "32% (average, vs. 27% in 2023)", "product_research_on_social_media_emerging_markets": "~50% in India", "purchased_after_social_media_exposure": "29% of surveyed consumers in Germany, UK, and US", "gen_x_on_tiktok": "33% (Europe and US)", "baby_boomers_on_instagram": "35% (Europe and US)", "douyin_wechat_use_china": "Nearly 90% of surveyed consumers across age groups"}, "gen_z_demographics_and_spending": {"average_25_year_old_us_household_income": "$40,000 (50% higher than average baby boomer at same age, adjusted)", "spending_growth_rate": "2x faster than previous generations at the same age", "likelihood_to_define_by_financial_security": {"career_success": "73% more likely than members of older generations", "creating_wealth": "36% more likely than members of older generations"}, "worried_about_financial_futures": {"germany_uk_us_gen_z": "About 40% (vs. 31% of older generations)", "china_gen_z": "Only 11%"}, "savings_to_support_lifestyle_less_than_1_month": {"us_gen_z": "Half (50%)", "germany_uk_gen_z": "35%", "china_gen_z": "8%"}, "buy_now_pay_later_use": ">1/4 of surveyed Gen Z respondents", "willingness_to_buy_on_credit": "34% of surveyed Gen Zers (13 percentage points higher than other generations)", "splurge_categories_gen_z": {"apparel": "34%", "beauty": "29%"}, "higher_share_using_delivery_services": "Gen Z consumers compared to members of any other generation"}, "local_brand_preference": {"global_importance_of_locally_owned_companies": "47% of consumers identify as important", "reason_support_domestic_businesses": "36% of consumers across markets", "reason_better_fit_needs": "20%", "reason_more_affordable": "13%", "european_perception_american_brands_may_2025": "42% worse or somewhat worse perception (vs. beginning of year)"}, "consumer_concerns": {"top_concern": "Rising prices (far outranks climate change, international conflict, unemployment)"}}, "temporal_info": {"consumer_habits_persistence": "Five years after start of COVID-19 pandemic", "market_outlook": "Second half of the decade", "survey_dates_q2_2025": "April 23 to May 6, 2025", "food_delivery_market_share_growth": "From 9% in 2019 to 21% in 2024", "gen_z_spending_projection_to_eclipse_boomers": "Globally by 2029", "gen_z_contribution_to_global_economy_projection": "Additional $8.9 trillion by 2035"}, "geographical_data": {"us_consumer_focus": "Explicitly highlighted in numerous statistics and trends", "other_markets_mentioned": ["China", "Germany", "United Kingdom", "Canada", "Brazil", "United Arab Emirates", "India", "Australia", "Japan"], "global_trends": "Many trends are discussed globally but with specific US data points provided", "local_preference_strongest_in": "Canada and the United States", "perception_of_american_brands": "42% of survey respondents in Europe had a worse or somewhat worse perception in May 2025"}, "references": ["Euromonitor International database, accessed May 2025", "World Economic Outlook: A critical juncture, International Monetary Fund, April 2025", "Spend Z, a joint report from GfK, NielsenIQ, and World Data Lab, 2024"]}